import {  Divider, Title } from "@/shared/ui";
import styles from "./qualityDesktop.module.scss";

const items = [
    {
        title: "پیشرفت‌ها را مدیون شکست‌ها هستیم",
        body: "محصولی باکیفیت و خلق برندي شناخته‌شده در سطح جهانی، دغدغه روزهای جوانی بنیانگذار لینا بود. اگر خاطراتی خوبی از اسنک «مریخی» داشته باشید، بد نیست بدانید که اولین تولید انبوه‌مان با این برند انجام شد. زمانی که با تولید اسنکی جدید و ارائه طعم به‌یادماندنی، یکی از پرفروش‌ترین اسنک‌ها را به بازار عرضه کردیم. استفاده از رنگ‌های مصنوعی در اسنک‌های آن زمان و خطرات این مواد افزودنی، تیم تحقیقاتی‌مان را به فکر واداشت تا اولین اسنک با رنگ طبیعی را در کشور تولید کنند."
    },
    {
        title: "با خلاقیت‌ها، به جهانیان معرفی شدیم",
        body: "گروه تحقیقاتی لینا، نوعی فلفل قرمز شیرین را براي تولید در اسنک‌های خود در نظر گرفت. رنگ طبیعی استفاده شده در محصولات لینا که از «پاپریکا» ساخته شده بود، سرشار از رنگدانه‌هاي طبیعی کاروتنوئید و آنتی اکسیدان بود که نقش موثري در سلامتی دارند.  سرانجام اولین اسنک در ایران با رنگ طبیعی پاپریکا و با نام «لینا توپی» توسط لینا تولید شد. به واسطه تولید محصولاتی باکیفیت و استفاده از رنگ طبیعی، لینا در ردیف صادرکنندگان برتر قرار گرفت. با عبور از استانداردهاي تعیین شده براي ورود به بازارهاي جهانی، صادرات به کشورهاي همسایه، حوزه خلیج فارس و اروپا را از آغاز شد."
    },
    {
        title: "رویاهای‌مان بزرگ می‌شوند",
        body: "عرضه اسنک‌های‌ باکیفیت و رضایت مصرف‌کنندگان، روزهای خوبی برای‌ ما رقم زده بود. وقت آن رسیده بود که با جدیت بیشتری در تولید محصولات سالم قدم برداریم. موفقیت‌ها ادامه یافت و به تدریج، دامنه محصولات ما گسترش یافت تا نیازهای متنوع‌تری از مشتریان را پاسخ دهد..."
    },
    {
        title: "و سرانجام، تحقق آرزوها",
        body: "گروه صنعتی لینا هر روز مصمم‌تر از قبل، دایره فعالیت خود را با هدف بهبود در کیفیت و تولید محصولات سالم و طبیعی گسترش خواهد داد تا با تولید محصولاتی با کیفیت بالاتر از استانداردهای رایج، در صنعت غذایی به جایگاهی بی‌نظیر دست یابد. این مسیر ادامه خواهد داشت تا به نقطه‌ای برسیم که محصولات لینا، انتخاب اول مصرف‌کنندگان در سراسر جهان باشد..."
    }
];

export const QualityDesktop = () => {
    return ( <>
        <div className={styles.container}>
            <div className={styles.title}>
                <Title> <span className={styles.localSpan}>کیفیت</span>  را هیچ‌گاه  <span className={styles.localSpan}>فراموش</span> نخواهیم کرد</Title>
            </div>
            <div className={styles.content}>
                <div className={styles.text}>روزهای طلایی ما همچنان ادامه داشت. لینا اقدام به خرید <span className={styles.localSpan}>بهترین ماشین‌آلات</span> و 
                    <span className={styles.localSpan}>تجهیزات تمام اتوماتیک </span>   از برندهاي مطرح دنیا نظیر امریکن اکسترودر، بولر سوییس، ولف آلمان، فلوریگوي هلند، ایشیکاي ژاپن و ممت  
                    ترکیه نمود تا <span className={styles.localSpan}>تضمین </span>  دیگري باشد براي <span className={styles.localSpan}>تولید محصول با بهترین کیفیت.</span>  این‌گونه لینا یک گام بزرگ دیگر در
                    راستاي چشم‌انداز خود برداشت. از طرف دیگر، <span className={styles.localSpan}>خلاقیت‌های لینا</span>  هیچ‌گاه خاموش نشد. در کلیه محصولات لینا
                    و با به‌کارگیري فرمولاسیون جدید، از <span className={styles.localSpan}>روغن فاقد اسیدهاي چرب ترانس و داراي اسیدهاي چرب مهم و ضروري امگا (،3 ،6 9)</span> 
                    به مقدار فراوان و <span className={styles.localSpan}>بدون مواد نگهدارنده</span>  استفاده می‌شود.
                </div>
                <div className={styles.pic}> <img src="/images/leaf.png" alt="" /></div>
            </div>
            <div className={styles.textChart}>
                {items.map((item, index) => (
                    <div key={index} className={styles.item}> 
                        <div className={styles.itemTitle}>{item.title}</div>
                        <div className={styles.itemBody}>{item.body}</div> 
                    </div>
                ))}
                
            </div>
            <div className={styles.arrows}>
        <div className={styles.arrowsPart}>
     <div className={styles.toTheLeft}>→</div>     
        <Divider width="55%" height="2px" className={styles.customDivider} />
      <div className={styles.toTheLeft}>←</div>
        </div>
                </div>
        </div>
    </> );
}
